# Задача 6: Вы пользуетесь общественным транспортом? Вероятно, вы расплачивались за проезд и получали билет с номером.
# Счастливым билетом называют такой билет с шестизначным номером, где сумма первых трех цифр равна сумме последних трех.
# Т.е. билет с номером 385916 – счастливый, т.к. 3+8+5=9+1+6. Вам требуется написать программу, которая проверяет
# счастливость билета.
#
# *Пример:*
#
# 385916 -> yes
# 123456 -> no
print("Задача №6:")
ticket_number = input("Введите номер билета: ")

first_half = ticket_number[:3]
second_half = ticket_number[3:]

sum_first_half = sum(int(digit) for digit in first_half)
sum_second_half = sum(int(digit) for digit in second_half)

if sum_first_half == sum_second_half:
    print("Да. Это счастливый билет.")
else:
    print("Нет. Это не счастливый билет.")